kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  msp_handler.sendPacket(&msp_out, &my_ctrl_serial);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    socketNumber = num;

    webSocket.sendTXT(num, my_ipaddress_info_str);
#if ESP_NOW
    webSocket.sendTXT(num, espnow_init_info);
#endif

    // Send settings
    SettingsGet();
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //webSocket.broadcastTXT(payload, length);

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {
      // ExLRS setting commands
      temp = strstr((char*)payload, "S_rate");
      if (temp) {
        handleSettingRate(&temp[6], num);
        break;
      }
      temp = strstr((char*)payload, "S_power");
      if (temp) {
        handleSettingPower(&temp[7], num);
        break;
      }
      temp = strstr((char*)payload, "S_telemetry");
      if (temp) {
        handleSettingTlm(&temp[11], num);
      }
      temp = strstr((char*)payload, "S_vtx_freq");
      if (temp) {
        MspVtxWrite(&temp[10], num);
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //webSocket.broadcastTXT("Invalid WStype: " + type);
    break;
  }
}

/***********************************************************************************/
/*************                   STM32 OTA UPGRADE                     *************/

int8_t flash_stm32(uint32_t flash_addr)
{
  int8_t result = -1;
  webSocket.broadcastTXT("STM32 Firmware Flash Requested!");
  webSocket.broadcastTXT("  the firmware file: '" + uploadedfilename + "'");
  if (uploadedfilename.endsWith("firmware.elrs")) {
    result = stk500_write_file(uploadedfilename.c_str());
  } else if (uploadedfilename.endsWith("firmware.bin")) {
    result = esp8266_spifs_write_file(uploadedfilename.c_str(), flash_addr);
    if (result == 0)
      reset_stm32_to_app_mode(); // boot into app
  } else {
    webSocket.broadcastTXT("Invalid file!");
  }
  Serial.begin(460800);
  return result;
}

void handleFileUploadEnd()
{
  uint32_t flash_base = BEGIN_ADDRESS;
  //String message = "\nRequest params:\n";
  for (uint8_t i = 0; i < server.args(); i++) {
    String name = server.argName(i);
    String value = server.arg(i);
      //message += " " + name + ": " + value + "\n";
      if (name == "flash_address") {
        flash_base = strtol(&value.c_str()[2], NULL, 16);
        break;
      }
  }
  //webSocket.broadcastTXT(message);

  int8_t success = flash_stm32(flash_base);

  if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
    FILESYSTEM.remove(uploadedfilename);

  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (success) ? "Update Successful!": "Update Failure!");
  server.send((success < 0) ? 400 : 200);
}

void handleFileUpload()
{ // upload a new file to the SPIFFS
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START)
  {
    /* Remove old file */
    if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
      FILESYSTEM.remove(uploadedfilename);

    FSInfo fs_info;
    if (FILESYSTEM.info(fs_info))
    {
      String output = "Filesystem: used: ";
      output += fs_info.usedBytes;
      output += " / free: ";
      output += fs_info.totalBytes;
      webSocket.broadcastTXT(output);

      if (fs_info.usedBytes > 0) {
        webSocket.broadcastTXT("formatting filesystem");
        FILESYSTEM.format();
      }
    }
    else
    {
      webSocket.broadcastTXT("SPIFFs Failed to init!");
      return;
    }
    uploadedfilename = upload.filename;

    webSocket.broadcastTXT("Uploading file: " + uploadedfilename);

    if (!uploadedfilename.startsWith("/"))
    {
      uploadedfilename = "/" + uploadedfilename;
    }
    fsUploadFile = FILESYSTEM.open(uploadedfilename, "w"); // Open the file for writing in SPIFFS (create if it doesn't exist)
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (fsUploadFile)
    {
      fsUploadFile.write(upload.buf, upload.currentSize); // Write the received bytes to the file
      String output = "Uploaded: ";
      output += fsUploadFile.position();
      output += " bytes";
      webSocket.broadcastTXT(output);
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (fsUploadFile)
    {                       // If the file was successfully created
      String totsize = "Total uploaded size ";
      totsize += fsUploadFile.position();
      totsize += " of ";
      totsize += upload.totalSize;
      webSocket.broadcastTXT(totsize);
      server.send(100);
      fsUploadFile.close(); // Close the file again
    }
    else
    {
      server.send(500, "text/plain", "500: couldn't create file");
    }
  }
}

/***********************************************************************************/
/*************                    ESP OTA UPGRADE                      *************/
#define LOCAL_OTA 0
#if LOCAL_OTA
void handleEspUpgrade(void)
{
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    //Serial.setDebugOutput(true);
    WiFiUDP::stopAll();
    //Serial.printf("Update: %s\n", upload.filename.c_str());
    webSocket.broadcastTXT("*** ESP OTA ***\n  file: " + upload.filename);

    /*if (upload.name != "backpack_fw") {
      webSocket.broadcastTXT("Invalid upload type!");
      return;
    } else*/ if (upload.filename.startsWith("backpack.bin")) {
      webSocket.broadcastTXT("Invalid file! Update aborted...");
      return;
    }

    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) { //start with max available size
      //Update.printError(Serial);
      webSocket.broadcastTXT("File is too big!");
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Junk write failed!");
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) { //true to set the size to the current progress
      //Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      webSocket.broadcastTXT("Update Success! Rebooting...");
    } else {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Update failed!");
    }
    //Serial.setDebugOutput(false);
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
  }
  delay(0); //same as yield();
}

