kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
void handleEspUpgradeFinalize(void)
{
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
  ESP.restart();
}
#endif // LOCAL_OTA

/***********************************************************************************/

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handleRoot()
{
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

void handleMacAddress()
{
  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += wifi_get_channel();
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

/******************* ESP-NOW *********************/
#if ESP_NOW

#include <espnow.h>

class CtrlSerialEspNow: public CtrlSerial
{
public:
  size_t available(void) {
    return 0; // not used
  }
  uint8_t read(void) {
    return 0; // not used
  }

  void write(uint8_t * buffer, size_t size) {
    while (size-- && p_iterator < sizeof(p_buffer)) {
      p_buffer[p_iterator++] = *buffer++;
    }
    if (p_iterator >= sizeof(p_buffer))
      p_iterator = UINT8_MAX; // error, not enough space
  }

  void reset(void) {
    p_iterator = 0;
  }
  void send_now(mspPacket_t *msp_in) {
    reset();
    if (msp_handler.sendPacket(msp_in, this) && p_iterator <= sizeof(p_buffer)) // check overflow
    {
      msp_handler.sendPacket(msp_in, this);
      esp_now_send(NULL, (uint8_t*)p_buffer, p_iterator);
      //webSocket.broadcastTXT("MSP sent!");
    }
  }

private:
  uint8_t p_buffer[128];
  uint8_t p_iterator = 0;
};

CtrlSerialEspNow esp_now_sender;

void esp_now_recv_cb(uint8_t *mac_addr, uint8_t *data, uint8_t data_len)
{
  /* No data or peer is unknown => ignore */
  if (!data_len || !esp_now_is_peer_exist(mac_addr))
    return;

  webSocket.broadcastTXT("ESP NOW message received!");

  // Pass data to ERLS
  // Note: accepts only correctly formatted MSP packets
  Serial.write((uint8_t*)data, data_len);
}

void esp_now_send_cb(uint8_t *mac_addr, u8 status) {
#if 0
  String temp = "ESPNOW Sent: ";
  temp += (status ? "FAIL" : "SUCCESS");
  webSocket.broadcastTXT(temp);
#endif
}

void init_esp_now(void)
{
  espnow_init_info = "ESP NOW init... ";

  if (esp_now_init() != 0) {
    espnow_init_info += "ESP NOW init failed!";
    return;
  }
  esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
  esp_now_register_send_cb(esp_now_send_cb);
  esp_now_register_recv_cb(esp_now_recv_cb);

#ifdef ESP_NOW_PEERS
#define ESP_NOW_ETH_ALEN 6
  uint8_t peers[][ESP_NOW_ETH_ALEN] = ESP_NOW_PEERS;
  uint8_t num_peers = sizeof(peers) / ESP_NOW_ETH_ALEN;
  for (uint8_t iter = 0; iter < num_peers; iter++) {
    //esp_now_del_peer(peers[iter]);
    if (esp_now_add_peer(peers[iter], ESP_NOW_ROLE_COMBO, ESP_NOW_CHANNEL, NULL, 0) != 0) {
      espnow_init_info += ", PEER ";
      espnow_init_info += iter;
      espnow_init_info += " FAIL";
    }
  }
#endif // ESP_NOW_PEERS

  espnow_init_info += " - Init DONE!";
}
#endif // ESP_NOW
/*************************************************/

void setup()
{
  IPAddress my_ip;
  uint8_t sta_up = 0;

#ifdef INVERTED_SERIAL
  Serial.begin(460800, SERIAL_8N1, SERIAL_FULL, 1, true); // inverted serial
#else
  Serial.begin(460800); // non-inverted serial
#endif

  FILESYSTEM.begin();

  wifi_station_set_hostname("elrs_tx");

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  if (WiFi.status() != WL_CONNECTED) {
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PSK, WIFI_CHANNEL);
  }
  uint32_t i = 0;
#define TIMEOUT (WIFI_TIMEOUT * 10)
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(100);
    if (++i > TIMEOUT) {
      break;
    }
  }
  sta_up = (WiFi.status() == WL_CONNECTED);

#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID " R9M")) {
    // AP found, connected
    sta_up = 1;
  }
#endif /* WIFI_MANAGER */

  if (!sta_up)
  {
    // WiFi not connected, Start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID " R9M", WIFI_AP_PSK, ESP_NOW_CHANNEL);
  }

#if ESP_NOW
  init_esp_now();
#endif // ESP_NOW

  my_ip = (sta_up) ? WiFi.localIP() : WiFi.softAPIP();

  if (mdns.begin("elrs_tx", my_ip))
  {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }
  my_ipaddress_info_str = "My IP address = ";
  my_ipaddress_info_str += my_ip.toString();

  //Serial.print("Connect to http://elrs_tx.local or http://");
  //Serial.println(my_ip);

  server.on("/", handleRoot);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);
#if LOCAL_OTA
  server.on("/update", HTTP_POST, // ESP OTA upgrade
    handleEspUpgradeFinalize, handleEspUpgrade);
#endif // LOCAL_OTA
  server.on("/upload", HTTP_POST, // STM32 OTA upgrade
    handleFileUploadEnd, handleFileUpload);

  server.onNotFound(handleRoot);
  httpUpdater.setup(&server);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
}

int serialEvent()
{
  char inChar;
  while (Serial.available())
  {
    inChar = (char)Serial.read();

    if (msp_handler.processReceivedByte(inChar)) {
      webSocket.broadcastTXT("MSP received");
      // msp fully received
      mspPacket_t &msp_in = msp_handler.getPacket();
      if (msp_in.type == MSP_PACKET_V1_ELRS) {
        uint8_t * payload = (uint8_t*)msp_in.payload;
        switch (msp_in.function) {
          case ELRS_INT_MSP_PARAMS: {
            webSocket.broadcastTXT("ELRS params resp");
            settings_rate = payload[0];
            settings_tlm = payload[1];
            settings_power = payload[2];
            settings_power_max = payload[3];
            settings_region = payload[4];

            handleSettingDomain(NULL);
            handleSettingRate(NULL);
            handleSettingPower(NULL);
            handleSettingTlm(NULL);
            break;
          }
        };
      }

#if ESP_NOW
      // Send received MSP packet to clients
      esp_now_sender.send_now(&msp_in);
#endif

      msp_handler.markPacketFree();
    } else if (!msp_handler.mspOngoing())
    {
      if (inChar == '\r') {
        continue;
      } else if (inChar == '\n') {
        return 0;
      }
      inputString += inChar;
    }
  }
  return -1;
}

void loop()
{
  if (0 <= serialEvent())
  {
    webSocket.broadcastTXT(inputString);
    inputString = "";
  }

  server.handleClient();
  webSocket.loop();
  mdns.update();
}
